InformationRegisters/БП_КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>БП_КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/БП_КонтрагентыКПереоценкеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>БП_КонтрагентыКПереоценкеЗапасов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Переоценка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ПартииТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийПартииТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Запись сформирована при списании партий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвиженияПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиСписанныхТоваров</Name>
					<Comment>Индекс строки списанных товаров</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/БП_ДокументыДляПерепроведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>БП_ДокументыДляПерепроведения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Проведено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/БП_ВидыДокументовДляЗаполненияПоПравилам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>БП_ВидыДокументовДляЗаполненияПоПравилам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РеализацияТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежноеПоручениеВходящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежноеПоручениеИсходящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходныйКассовыйОрдер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходныйКассовыйОрдер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыУсловийДоговоровВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыУсловийДоговоровВзаиморасчетов</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезДополнительныхУсловий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СДополнительнымиУсловиями</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бартерный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПоРасчетнымДокументам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/БП_ВидЗаказаПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>БП_ВидЗаказаПоставщику</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Менеджер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бухгалтер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТипыЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ТипыЦенНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦен</Name>
					<Comment>(Общ) Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассчитывается</Name>
					<Comment>(Общ) Истина - цены автоматически рассчитываются (не хранятся) на основании цен базового типа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Comment>(Общ) Истина - цена включает НДС, ложь - не включает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругления</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Comment>(Общ) Истина, то при порядке округления "5" 0.01 будет округлена до 5, ложь - округление по арифметическим правилам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Безнал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПараметрыРасчетаЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦенГараж</Name>
					<Comment>(Общ) Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрРасчетаЦеныДиски</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПараметрыРасчетаЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦенДиски</Name>
					<Comment>(Общ) Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенНал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтаройЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/БП_ОбщийМодуль/Ext/Module.bsl
Процедура БП_ПереоцінкаЗапасів() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ДатаКурса = ТекущаяДата();
	ДатаКурсаТекст = Формат(ДатаКурса,"ДФ=yyyyMMdd");
	HTTP =  Новый HTTPСоединение("bank.gov.ua",443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	ЗапросТекст="/NBUStatService/v1/statdirectory/exchange?date="+ДатаКурсаТекст+"&json";    

	Попытка
		HTTPОтвет = HTTP.Получить(Новый HTTPЗапрос(ЗапросТекст));
	Исключение
		сообщить(ОписаниеОшибки()); 
	КонецПопытки;         
	
	ОтветСервера = HTTPОтвет.ПолучитьТелоКакСтроку();
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ОтветСервера);
	Объект = ПрочитатьJSON(Чтение, Истина);
	
	Для Каждого Соответствие Из Объект Цикл 
		
		КодВалюты = Соответствие.Получить("r030"); 
		КурсВалюты = Соответствие.Получить("rate"); 
		Если КодВалюты = Неопределено тогда
			Продолжить;
		КонецЕсли;
		
		Валюта = Справочники.Валюты.НайтиПоКоду(КодВалюты,,,);
		Если Валюта = Справочники.Валюты.ПустаяСсылка() тогда 
			Продолжить;
		КонецЕсли;
		
		РегистрКурсыВалют = РегистрыСведений.БП_КурсыВалют;
		ЗаписьКурсовВалют = РегистрКурсыВалют.СоздатьМенеджерЗаписи();
		ЗаписьКурсовВалют.Валюта = Валюта;
		ЗаписьКурсовВалют.Период = ДатаКурса;
		ЗаписьКурсовВалют.Прочитать();
		ЗаписьКурсовВалют.Валюта    = Валюта;
		ЗаписьКурсовВалют.Период    = ДатаКурса;
		ЗаписьКурсовВалют.Курс      = КурсВалюты;
		ЗаписьКурсовВалют.Кратность = 1;
		ЗаписьКурсовВалют.Записать();	
	КонецЦикла; 
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БП_КонтрагентыКПереоценкеЗапасов.Контрагент,
	                      |	БП_КонтрагентыКПереоценкеЗапасов.ДоговорКонтрагента
	                      |ИЗ
	                      |	РегистрСведений.БП_КонтрагентыКПереоценкеЗапасов КАК БП_КонтрагентыКПереоценкеЗапасов
	                      |ГДЕ
	                      |	БП_КонтрагентыКПереоценкеЗапасов.Переоценка");   
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	МассивДоговоров = ТЗ.ВыгрузитьКолонку("ДоговорКонтрагента"); 
	
	ТабПериоценить = новый ТаблицаЗначений;
	ТабПериоценить.Колонки.Добавить("Номенклатура");
	ТабПериоценить.Колонки.Добавить("ЦенаПартииНовая");
	ТабПериоценить.Колонки.Добавить("ДоговорПоставщика");
	
	ЗапросОст = новый запрос;
	ЗапросОст.Текст = "ВЫБРАТЬ
	                  |	ПартииТоваровНаСкладахОстатки.Номенклатура КАК Номенклатура,
	                  |	ПартииТоваровНаСкладахОстатки.Склад КАК Склад,
	                  |	ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                  |	ПартииТоваровНаСкладахОстатки.СерияНоменклатуры КАК СерияНоменклатуры,
	                  |	ПартииТоваровНаСкладахОстатки.ДокументОприходования КАК ДокументОприходования,
	                  |	ПартииТоваровНаСкладахОстатки.СтатусПартии КАК СтатусПартии,
	                  |	ПартииТоваровНаСкладахОстатки.Заказ КАК Заказ,
	                  |	ПартииТоваровНаСкладахОстатки.Качество КАК Качество,
	                  |	СУММА(ПартииТоваровНаСкладахОстатки.КоличествоОстаток) КАК Количество,
	                  |	СУММА(ПартииТоваровНаСкладахОстатки.СтоимостьОстаток) КАК Стоимость,
	                  |	0 КАК СтоимостьНовая,
	                  |	0 КАК СтоимостьОтличие,
	                  |	0 КАК ЦенаПартииНовая,
	                  |	ПартииТоваровНаСкладахОстатки.ДокументОприходования.КурсВзаиморасчетов КАК КурсСтарый,
	                  |	ВЫБОР
	                  |		КОГДА ЕСТЬNULL(БП_КурсыВалютСрезПоследних.Курс, 0) < ЕСТЬNULL(ДоговорыКонтрагентовБП_МинКурс.Курс, 0)
	                  |			ТОГДА ЕСТЬNULL(ДоговорыКонтрагентовБП_МинКурс.Курс, 0)
	                  |		ИНАЧЕ ЕСТЬNULL(БП_КурсыВалютСрезПоследних.Курс, 0)
	                  |	КОНЕЦ КАК КурсНовый,
	                  |	ПартииТоваровНаСкладахОстатки.ДокументОприходования.ДоговорКонтрагента КАК ДоговорКонтрагента
	                  |ИЗ
	                  |	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&ДатаОст, ДокументОприходования.ДоговорКонтрагента В (&ДоговорКонтрагента)) КАК ПартииТоваровНаСкладахОстатки
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БП_КурсыВалют.СрезПоследних(&ДатаОст, ) КАК БП_КурсыВалютСрезПоследних
	                  |		ПО ПартииТоваровНаСкладахОстатки.ДокументОприходования.ВалютаДокумента = БП_КурсыВалютСрезПоследних.Валюта
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.БП_МинКурс КАК ДоговорыКонтрагентовБП_МинКурс
	                  |		ПО ПартииТоваровНаСкладахОстатки.ДокументОприходования.ВалютаДокумента = ДоговорыКонтрагентовБП_МинКурс.Валюта
	                  |			И ПартииТоваровНаСкладахОстатки.ДокументОприходования.ДоговорКонтрагента = ДоговорыКонтрагентовБП_МинКурс.Ссылка
	                  |ГДЕ
	                  |	ПартииТоваровНаСкладахОстатки.ДокументОприходования.ВалютаДокумента <> &ВалютаРег
	                  |	И ПартииТоваровНаСкладахОстатки.КоличествоОстаток > 0
	                  |	И БП_КурсыВалютСрезПоследних.Курс > 0
	                  |
	                  |СГРУППИРОВАТЬ ПО
	                  |	ПартииТоваровНаСкладахОстатки.Заказ,
	                  |	ПартииТоваровНаСкладахОстатки.Склад,
	                  |	ПартииТоваровНаСкладахОстатки.Номенклатура,
	                  |	ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры,
	                  |	ПартииТоваровНаСкладахОстатки.Качество,
	                  |	ПартииТоваровНаСкладахОстатки.СерияНоменклатуры,
	                  |	ПартииТоваровНаСкладахОстатки.СтатусПартии,
	                  |	ПартииТоваровНаСкладахОстатки.ДокументОприходования,
	                  |	ПартииТоваровНаСкладахОстатки.ДокументОприходования.КурсВзаиморасчетов,
	                  |	ПартииТоваровНаСкладахОстатки.ДокументОприходования.ДоговорКонтрагента,
	                  |	ВЫБОР
	                  |		КОГДА ЕСТЬNULL(БП_КурсыВалютСрезПоследних.Курс, 0) < ЕСТЬNULL(ДоговорыКонтрагентовБП_МинКурс.Курс, 0)
	                  |			ТОГДА ЕСТЬNULL(ДоговорыКонтрагентовБП_МинКурс.Курс, 0)
	                  |		ИНАЧЕ ЕСТЬNULL(БП_КурсыВалютСрезПоследних.Курс, 0)
	                  |	КОНЕЦ";
	
	ЗапросОст.УстановитьПараметр("ДатаОст", ТекущаяДата());
	ЗапросОст.УстановитьПараметр("ДоговорКонтрагента", МассивДоговоров); 
	ЗапросОст.УстановитьПараметр("ВалютаРег", глЗначениеПеременной("ВалютаРегламентированногоУчета"));
	РезОст = ЗапросОст.Выполнить().Выгрузить();  
	
	Для каждого СтрокаТовар из РезОст цикл 
		ЦенаСтарая = (СтрокаТовар.Стоимость / СтрокаТовар.Количество) / СтрокаТовар.КурсСтарый;	
		СтоимостьНовая = (СтрокаТовар.Количество * ЦенаСтарая) * СтрокаТовар.КурсНовый;  
		СтрокаТовар.ЦенаПартииНовая = ЦенаСтарая * СтрокаТовар.КурсНовый ;
		СтрокаТовар.СтоимостьНовая = СтоимостьНовая; 
		СтрокаТовар.СтоимостьОтличие = СтоимостьНовая - СтрокаТовар.Стоимость;
	КонецЦикла;   

	РезОстТовары = РезОст.Скопировать(,"Номенклатура,ЦенаПартииНовая,ДоговорКонтрагента");
	РезОстТовары.Свернуть("Номенклатура,ЦенаПартииНовая,ДоговорКонтрагента");
	Для каждого Договор из МассивДоговоров цикл
		ОтборСтрок = новый Структура("ДоговорКонтрагента", Договор);
		ТЗОстаткиОтбор = РезОст.НайтиСтроки(ОтборСтрок);
		РезОстТоварыОтбор = РезОстТовары.НайтиСтроки(ОтборСтрок); 
		
		ДокПереоценка = Документы.ПереоценкаЗапасов_СД.СоздатьДокумент();
		ДокПереоценка.Дата = ТекущаяДата();
		ДокПереоценка.ДоговорКонтрагента = Договор;
		ДокПереоценка.Контрагент         = Договор.Владелец;
		ДокПереоценка.Комментарий = "#Створено автоматично!";	
		Для каждого СтрокаОстаток из ТЗОстаткиОтбор Цикл 
			НоваяСтрокаОстатков = ДокПереоценка.ОстаткиПартии.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаОстатков, СтрокаОстаток);	
		КонецЦикла;	
		
		Для каждого СтрокаТовары из РезОстТоварыОтбор Цикл 
			НоваяСтрокаТоваров = ДокПереоценка.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТоваров, СтрокаТовары);	
		КонецЦикла;
		ДокПереоценка.Товары.Свернуть("Номенклатура,ЦенаПартииНовая");
		ДокПереоценка.Записать(РежимЗаписиДокумента.Запись);
		Если ДокПереоценка.Товары.Количество() > 0 Тогда 
			Попытка
				ДокПереоценка.Записать(РежимЗаписиДокумента.Проведение);
			Исключение	
				ДокПереоценка.Записать(РежимЗаписиДокумента.Запись);
				//ЗаписьЖурналаРегистрации("Документы.ПереоценкаЗапасов_СД" ,УровеньЖурналаРегистрации.Ошибка,Метаданные.Обработки.ЗагрузкаОстаткаИЦенПоставщика_СД,ОписаниеОшибки(), ОписаниеОшибки()); //bsoft (21.08.2024)
			КонецПопытки;
		КонецЕсли;

	КонецЦикла;	
	
	//Обработки.БП_РасчетРейтингаПоПравиламРанжировки.ВыполнитьВсе();
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура ИзменитьОрганизацию(ДокументОб = Неопределено, ИзмениласьФормаРасчета = Ложь, Автозамена = Истина, ИзмениласьОрганизация = Ложь, СуммаДляВыбораОрганизации = Неопределено) Экспорт 
    УстановитьПривилегированныйРежим(Истина);
	Если ДокументОб = Неопределено ИЛИ Не Автозамена тогда
		Возврат;
	КонецЕсли;
	
	Если ИзмениласьФормаРасчета тогда 
		ФормаРасчета = ДокументОб.ФормаРасчета;
		Если не ЗначениеЗаполнено(ФормаРасчета) тогда
			Возврат;
		КонецЕсли;
		
		//+БП: @Cvet_kov (02.09.2026) <>
		// Организация может зависеть от суммы: табличная часть ОрганизацииПоСумме
		// в карточке формы расчёта (СуммаДо / Организация / БанковскийСчет).
		// Пока она пуста - работают прежние реквизиты Организация и ОсновнойБанковскийСчет.
		НастройкаПоСумме = ОрганизацияПоФормеРасчетаИСумме(ФормаРасчета, СуммаДляВыбораОрганизации, ДокументОб);
		
		Если НастройкаПоСумме <> Неопределено тогда
			ДокументОб.Организация = НастройкаПоСумме.Организация;
			
			Если ТипЗнч(ДокументОб) = Тип("ДокументОбъект.ЗаказПокупателя")
				И ЗначениеЗаполнено(НастройкаПоСумме.БанковскийСчет) тогда
				ДокументОб.СтруктурнаяЕдиница = НастройкаПоСумме.БанковскийСчет;	
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(ФормаРасчета.Организация) тогда
				ДокументОб.Организация = ФормаРасчета.Организация;	
			КонецЕсли;

			Если ТипЗнч(ДокументОб) = Тип("ДокументОбъект.ЗаказПокупателя") тогда
				ДокументОб.СтруктурнаяЕдиница = ФормаРасчета.ОсновнойБанковскийСчет;	
			КонецЕсли;		
		КонецЕсли;
		//-БП: @Cvet_kov (02.09.2026) <>
	КонецЕсли; 
	
	
	Если НЕ (ТипЗнч(ДокументОб) = Тип("ДокументОбъект.РеализацияТоваровУслуг") 
				ИЛИ ТипЗнч(ДокументОб) = Тип("ДокументОбъект.ПлатежноеПоручениеВходящее")
				ИЛИ ТипЗнч(ДокументОб) = Тип("ДокументОбъект.ПлатежноеПоручениеИсходящее")
				ИЛИ ТипЗнч(ДокументОб) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер")
				ИЛИ ТипЗнч(ДокументОб) = Тип("ДокументОбъект.РасходныйКассовыйОрдер")
				ИЛИ ТипЗнч(ДокументОб) = Тип("ДокументОбъект.ПриемТовараНаХранение")) тогда
			
			Возврат
	КонецЕсли;                   
	
	Если ИзмениласьОрганизация тогда
		ПравилаЗаполненияДокументов = ДокументОб.Организация.ПравилаЗаполненияДокументов;                                        
		Если Не ПравилаЗаполненияДокументов.Количество() тогда
			Сообщить("Не заповнені правила налаштувань в карточці організації!");
			Возврат;
		КонецЕсли;

		Если ТипЗнч(ДокументОб) = Тип("ДокументОбъект.РеализацияТоваровУслуг") тогда 			
			НайденнаяСтрока = ПравилаЗаполненияДокументов.Найти(Перечисления.БП_ВидыДокументовДляЗаполненияПоПравилам.РеализацияТоваровУслуг, "ВидДокумента");
			Если НайденнаяСтрока <> Неопределено Тогда
				ДокументОб.ОтражатьВУправленческомУчете = НайденнаяСтрока.ОтражатьВУправленческомУчете;
				ДокументОб.ОтражатьВБухгалтерскомУчете  = НайденнаяСтрока.ОтражатьВБухгалтерскомУчете;
				ДокументОб.ОтражатьВНалоговомУчете 		= НайденнаяСтрока.ОтражатьВНалоговомУчете;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДокументОб) = Тип("ДокументОбъект.ПлатежноеПоручениеВходящее") тогда
			НайденнаяСтрока = ПравилаЗаполненияДокументов.Найти(Перечисления.БП_ВидыДокументовДляЗаполненияПоПравилам.ПлатежноеПоручениеВходящее, "ВидДокумента");
			Если НайденнаяСтрока <> Неопределено Тогда
				ДокументОб.ОтражатьВБухгалтерскомУчете = НайденнаяСтрока.ОтражатьВБухгалтерскомУчете;
				ДокументОб.ОтражатьВНалоговомУчете     = НайденнаяСтрока.ОтражатьВНалоговомУчете;
				ДокументОб.ОтраженоВОперУчете  		   = НайденнаяСтрока.ОтраженоВОперУчете;
				ДокументОб.Оплачено 				   = НайденнаяСтрока.Оплачено; 
				
				Для каждого СтрокаТЧ из ДокументОб.РасшифровкаПлатежа цикл 
					СтрокаТЧ.СтатьяДекларацииПоЕдиномуНалогу = НайденнаяСтрока.СтатьяДекларацииПоЕдиномуНалогу;
					
					Если ЗначениеЗаполнено(НайденнаяСтрока.СтавкаНДС) тогда
						СтрокаТЧ.СтавкаНДС = НайденнаяСтрока.СтавкаНДС;	
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;	
		ИначеЕсли ТипЗнч(ДокументОб) = Тип("ДокументОбъект.ПлатежноеПоручениеИсходящее") тогда
			НайденнаяСтрока = ПравилаЗаполненияДокументов.Найти(Перечисления.БП_ВидыДокументовДляЗаполненияПоПравилам.ПлатежноеПоручениеИсходящее, "ВидДокумента");
			Если НайденнаяСтрока <> Неопределено Тогда
				ДокументОб.ОтражатьВБухгалтерскомУчете = НайденнаяСтрока.ОтражатьВБухгалтерскомУчете;
				ДокументОб.ОтражатьВНалоговомУчете     = НайденнаяСтрока.ОтражатьВНалоговомУчете;
				ДокументОб.ОтраженоВОперУчете  		   = НайденнаяСтрока.ОтраженоВОперУчете;
				ДокументОб.Оплачено 				   = НайденнаяСтрока.Оплачено; 
				
				Для каждого СтрокаТЧ из ДокументОб.РасшифровкаПлатежа цикл 
					СтрокаТЧ.СтатьяДекларацииПоЕдиномуНалогу = НайденнаяСтрока.СтатьяДекларацииПоЕдиномуНалогу;	
				КонецЦикла;
			КонецЕсли;				
		ИначеЕсли ТипЗнч(ДокументОб) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") тогда
			НайденнаяСтрока = ПравилаЗаполненияДокументов.Найти(Перечисления.БП_ВидыДокументовДляЗаполненияПоПравилам.ПриходныйКассовыйОрдер, "ВидДокумента");
			Если НайденнаяСтрока <> Неопределено Тогда
				ДокументОб.ОтражатьВУправленческомУчете = НайденнаяСтрока.ОтражатьВУправленческомУчете;
				ДокументОб.ОтражатьВБухгалтерскомУчете  = НайденнаяСтрока.ОтражатьВБухгалтерскомУчете;
				ДокументОб.ОтраженоВОперУчете 			= НайденнаяСтрока.ОтраженоВОперУчете;
				ДокументОб.ОтражатьВНалоговомУчете      = НайденнаяСтрока.ОтражатьВНалоговомУчете;
				ДокументОб.Оплачено 				    = НайденнаяСтрока.Оплачено; 
				ДокументОб.Чек		 				    = НайденнаяСтрока.Чек;
			КонецЕсли;				
		ИначеЕсли ТипЗнч(ДокументОб) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") тогда
			НайденнаяСтрока = ПравилаЗаполненияДокументов.Найти(Перечисления.БП_ВидыДокументовДляЗаполненияПоПравилам.РасходныйКассовыйОрдер, "ВидДокумента");
			Если НайденнаяСтрока <> Неопределено Тогда
				ДокументОб.ОтражатьВУправленческомУчете = НайденнаяСтрока.ОтражатьВУправленческомУчете;
				ДокументОб.ОтражатьВБухгалтерскомУчете  = НайденнаяСтрока.ОтражатьВБухгалтерскомУчете;
				ДокументОб.ОтраженоВОперУчете 			= НайденнаяСтрока.ОтраженоВОперУчете; 
				ДокументОб.ОтражатьВНалоговомУчете      = НайденнаяСтрока.ОтражатьВНалоговомУчете;
				ДокументОб.Оплачено 				    = НайденнаяСтрока.Оплачено;  
				ДокументОб.Чек		 				    = НайденнаяСтрока.Чек;
			КонецЕсли;				
		КонецЕсли;
			
	КонецЕсли;     
	 УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры	


//+БП: @Cvet_kov (02.09.2026) <>
// Возвращает строку табличной части ФормыРасчета.ОрганизацииПоСумме, подходящую под сумму
// документа, или Неопределено, если таблица не заполнена - тогда вызывающий код работает
// по прежним реквизитам формы расчёта.
//
// Параметры:
//  ФормаРасчета - СправочникСсылка.ФормыРасчета
//  Сумма        - Число - сумма, по которой выбирается организация; Неопределено - взять из документа
//  ДокументОб   - ДокументОбъект - источник суммы, если она не передана явно
//
// Строка с нулевым лимитом СуммаДо считается строкой "и выше" и уходит в конец списка.
// Если сумма больше всех лимитов, берётся последняя строка.
//
Функция ОрганизацияПоФормеРасчетаИСумме(ФормаРасчета, Сумма = Неопределено, ДокументОб = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ФормаРасчета) тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Настройки = ФормаРасчета.ОрганизацииПоСумме.Выгрузить();
	
	Если Настройки.Количество() = 0 тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// строки без организации ни на что не годятся
	СтрокиБезОрганизации = Настройки.НайтиСтроки(Новый Структура("Организация", Справочники.Организации.ПустаяСсылка()));
	Для каждого СтрокаБезОрганизации Из СтрокиБезОрганизации Цикл
		Настройки.Удалить(СтрокаБезОрганизации);
	КонецЦикла;
	
	Если Настройки.Количество() = 0 тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Настройки.Колонки.Добавить("БезВерхнейГраницы", Новый ОписаниеТипов("Число"));
	Для каждого СтрокаНастройки Из Настройки Цикл
		СтрокаНастройки.БезВерхнейГраницы = ?(СтрокаНастройки.СуммаДо = 0, 1, 0);
	КонецЦикла;
	
	Настройки.Сортировать("БезВерхнейГраницы Возр, СуммаДо Возр");
	
	СуммаВыбора = Сумма;
	Если СуммаВыбора = Неопределено тогда
		СуммаВыбора = СуммаДокументаДляВыбораОрганизации(ДокументОб);
	КонецЕсли;
	
	Для каждого СтрокаНастройки Из Настройки Цикл
		Если СтрокаНастройки.БезВерхнейГраницы = 1 ИЛИ СуммаВыбора <= СтрокаНастройки.СуммаДо тогда
			Возврат СтрокаНастройки;
		КонецЕсли;
	КонецЦикла;
	
	// сумма больше всех лимитов - последняя, самая "старшая" строка
	Возврат Настройки[Настройки.Количество() - 1];
	
КонецФункции

// Сумма документа для выбора организации, когда она не передана явно.
// Товары берутся тоже: организация подставляется до заполнения табличной части,
// и в этот момент СуммаДокумента ещё нулевая.
//
Функция СуммаДокументаДляВыбораОрганизации(ДокументОб)
	
	Если ДокументОб = Неопределено тогда
		Возврат 0;
	КонецЕсли;
	
	СуммаДокумента = 0;
	Попытка
		СуммаДокумента = ДокументОб.СуммаДокумента;
	Исключение
	КонецПопытки;
	
	СуммаТоваров = 0;
	Попытка
		СуммаТоваров = ДокументОб.Товары.Итог("Сумма");
	Исключение
	КонецПопытки;
	
	Возврат Макс(СуммаДокумента, СуммаТоваров);
	
КонецФункции
//-БП: @Cvet_kov (02.09.2026) <>


Процедура ПоискСозданиеДоговора(ДокументОб = Неопределено,Организация,Контрагент) Экспорт
	 УстановитьПривилегированныйРежим(Истина);
	Если Не ЗначениеЗаполнено(Организация) ИЛИ Не ЗначениеЗаполнено(Контрагент) ИЛИ ДокументОб = Неопределено тогда
		Сообщить("Не заповнена організація або договір!");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ДоговорыКонтрагентов.Ссылка КАК Договор
	                      |ИЗ
	                      |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                      |ГДЕ
	                      |	ДоговорыКонтрагентов.Владелец = &Контрагент
	                      |	И ДоговорыКонтрагентов.Организация = &Организация
	                      |	И НЕ ДоговорыКонтрагентов.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
		ДокументОб.ДоговорКонтрагента = Выборка.Договор;
		Возврат; 		
	КонецЦикла;
	
	//якщо немає договору то створюємо
	
	НовыйДоговор			 		  = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	НовыйДоговор.Наименование		  = НСтр("ru='Основной договор';uk='Основний договір'");
	НовыйДоговор.ВалютаВзаиморасчетов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяВалютаВзаиморасчетов");
	
	Если НЕ ЗначениеЗаполнено(НовыйДоговор.ВалютаВзаиморасчетов) Тогда
		НовыйДоговор.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	КонецЕсли;
	
	НовыйДоговор.УстановитьСхемуНалогообложения();
	
	Если Контрагент.НеЯвляетсяРезидентом Тогда
		НовыйДоговор.Внешнеэкономический = Истина;
		Если НовыйДоговор.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаРегламентированногоУчета") Тогда
			НовыйДоговор.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаУправленческогоУчета");
		КонецЕсли;
	КонецЕсли;
	
	НовыйДоговор.Организация 		= Организация;	
	НовыйДоговор.Владелец           = Контрагент;
	НовыйДоговор.ВидУсловийДоговора = Перечисления.ВидыУсловийДоговоровВзаиморасчетов.БезДополнительныхУсловий;
	НовыйДоговор.ВидДоговора 		= Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	НовыйДоговор.БП_ТипДоговора 	= Справочники.БП_ТипыДоговоровКонтрагентов.Стандартный;	
	НовыйДоговор.ТипЦен     		= Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();			
	НовыйДоговор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам;
	Если НовыйДоговор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
		ИЛИ НовыйДоговор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
		НовыйДоговор.ОбособленныйУчетТоваровПоЗаказамПокупателей = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОбособленныйУчетТоваровПоЗаказамПокупателей");
	КонецЕсли;
	
	НовыйДоговор.СхемаНалоговогоУчета 	    				  = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.ПоПервомуСобытию;
	НовыйДоговор.СхемаНалоговогоУчетаПоТаре 				  = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.ПоПервомуСобытию;
	НовыйДоговор.ВыводитьИнформациюОСделкеПриПечатиДокументов = Истина;
	НовыйДоговор.Комментарий = "#Створено автоматично!";
	Попытка
		НовыйДоговор.Записать();
		Сообщить("Успішно створено новий договір!");
		ДокументОб.ДоговорКонтрагента = НовыйДоговор.Ссылка;
	Исключение
		Сообщить("Не вдалося створити договір! " + ОписаниеОшибки());
	КонецПопытки;                   
	УстановитьПривилегированныйРежим(Ложь);
	Возврат;	
	
КонецПроцедуры  

Процедура АвтообработкаЗаказаПокупателяПоНП() Экспорт
	//+БП: d.matyash (03.10.2025) <> 
	АвтообработкаЗаказаПокупателяПоНП = Обработки.АвтообработкаЗаказаПокупателяПоНП.Создать(); 
	АвтообработкаЗаказаПокупателяПоНП.ОбновитьСтатусы(); 
	Для каждого Стр из АвтообработкаЗаказаПокупателяПоНП.СтатусыЗаказовПокупателя цикл
		Стр.Пометка = Истина;	
	КонецЦикла;
	АвтообработкаЗаказаПокупателяПоНП.АвтообработкаЗаказов();;
	//-БП: d.matyash (03.10.2025) <>
КонецПроцедуры


Процедура ЗапускРанжировкиВФоне() Экспорт
	Обработки.БП_РасчетРейтингаПоПравиламРанжировки.ВыполнитьВсеСФона();	
КонецПроцедуры

Процедура БП_РанжуванняТоваров() Экспорт
	Обработки.БП_РасчетРейтингаПоПравиламРанжировки.ВыполнитьВсеСФона();
КонецПроцедуры

Процедура БП_РанжировкаТоваров() Экспорт
	Обработки.БП_РасчетРейтингаПоПравиламРанжировки.ВыполнитьВсеСФона();
КонецПроцедуры    

Процедура БП_ЗапускНазначенияБейджиков() Экспорт
	Обработки.БП_НазначенияБейджиковПоПравилам.ВыполнитьВсеСФона();	
КонецПроцедуры 

Процедура БП_НазначенияБейджиков() Экспорт
	Обработки.БП_НазначенияБейджиковПоПравилам.ВыполнитьНЕКритическийВсеСФона();
КонецПроцедуры

Процедура БП_ЗаполнитьПартии(РеализацияТоваровУслуг) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТоварыВрем = РеализацияТоваровУслуг.Товары.Выгрузить();
	
	Если Не ТоварыВрем.Количество() тогда
		Возврат;
	КонецЕсли;
	
	ЗаказПокупателя = РеализацияТоваровУслуг.Сделка;
	
	Если НЕ (ТипЗнч(ЗаказПокупателя) = Тип("ДокументСсылка.ЗаказПокупателя") И ЗначениеЗаполнено(ЗаказПокупателя)) тогда
		Сообщить("Не вдалося знайти пов'язаний документ Замовлення покупця, автозаповнення партії не буде виконано!");
		Возврат;
	КонецЕсли;  
	
	БП_СозданоАвтоматично = Истина;
	
	НомерСтроки = 0;
	ТоварыВрем = РеализацияТоваровУслуг.Товары.Выгрузить();
	Для Каждого СтрокаРеал Из ТоварыВрем Цикл
		
		// Отримуємо таблицю партій для цієї номенклатури (по ФІФО)
		ТзПартия = РеализацияТоваровУслугЗаполнитьПартию(
		КонецДня(РеализацияТоваровУслуг.Дата),
		СтрокаРеал.Номенклатура,
		РеализацияТоваровУслуг.Организация,
		РеализацияТоваровУслуг.Склад,
		ЗаказПокупателя
		);
		
		Остаток = СтрокаРеал.Количество;
		
		Для Каждого СтрокаПарт Из ТзПартия Цикл
			
			Если Остаток <= 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если СтрокаПарт.Количество <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СписатьКоличество = Мин(Остаток, СтрокаПарт.Количество);
			
			// --- Створюємо новий рядок табличної частини
			НоваяСтрока = РеализацияТоваровУслуг.Товары.Добавить();
			
			// Копіюємо реквізити з оригінального рядка
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРеал);
			
			// Проставляємо конкретну партію та кількість
			НоваяСтрока.ДокументПартии = СтрокаПарт.Партия;
			НоваяСтрока.Количество = СписатьКоличество; 
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, РеализацияТоваровУслуг);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, РеализацияТоваровУслуг);
			
			// --- Зменшуємо залишки
			Остаток = Остаток - СписатьКоличество;
			СтрокаПарт.Количество = СтрокаПарт.Количество - СписатьКоличество;
			
		КонецЦикла;
		
		// Після розподілу — видаляємо вихідний рядок (він уже розбитий)
		РеализацияТоваровУслуг.Товары.Удалить(0);
		
	КонецЦикла;
КонецПроцедуры 
                                      
Функция РеализацияТоваровУслугЗаполнитьПартию(Дата, Номенклатура, Организация, Склад, ЗаказПокупателя)  
	
	//Спочатку шукаємо партію по замовленню покупця або постачальнику 
	МассивЗаказовПоставщику = Новый Массив;

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаказПоставщикуТовары.Ссылка
	                      |ИЗ
	                      |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	                      |ГДЕ
	                      |	ЗаказПоставщикуТовары.Номенклатура = &Номенклатура
	                      |	И ЗаказПоставщикуТовары.Ссылка.Проведен 
						  |	И ЗаказПоставщикуТовары.Ссылка.ДокументОснование = &ДокументОснование 
	                      |	И ЗаказПоставщикуТовары.Ссылка.БП_ВидЗаказаПоставщику = &БП_ВидЗаказаПоставщику
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗаказПоставщикуТовары.Ссылка");

	//Запрос = Новый Запрос("ВЫБРАТЬ
	//	                      |	ЗаказПоставщику.Ссылка
	//	                      |ИЗ
	//	                      |	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	//	                      |ГДЕ
	//	                      |	ЗаказПоставщику.Проведен
	//	                      |	И ЗаказПоставщику.ДокументОснование = &ДокументОснование
	//	                      |	И ЗаказПоставщику.БП_ВидЗаказаПоставщику = &БП_ВидЗаказаПоставщику");
	
	Запрос.УстановитьПараметр("ДокументОснование", ЗаказПокупателя); 
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("БП_ВидЗаказаПоставщику", Перечисления.БП_ВидЗаказаПоставщику.Менеджер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
    	МассивЗаказовПоставщику.Добавить(Выборка.Ссылка);	
	КонецЦикла;                          
	
	Если МассивЗаказовПоставщику.Количество() тогда
		// якщо є замовлення постачальнику то склад НЕ наш
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ПоступлениеТоваровУслугТовары.Ссылка КАК Партия,
		                      |	ПоступлениеТоваровУслугТовары.Номенклатура,
		                      |	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество
		                      |ИЗ
		                      |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		                      |ГДЕ
		                      |	ПоступлениеТоваровУслугТовары.Ссылка.Сделка В(&Сделка)
		                      |	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен
		                      |	И ПоступлениеТоваровУслугТовары.Номенклатура = &Номенклатура
		                      |	И ПоступлениеТоваровУслугТовары.Ссылка.ОтражатьВУправленческомУчете
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ПоступлениеТоваровУслугТовары.Номенклатура,
		                      |	ПоступлениеТоваровУслугТовары.Ссылка");
		
		Запрос.УстановитьПараметр("Сделка", МассивЗаказовПоставщику); 
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		//Если ТЗ.Количество() тогда
			Возврат ТЗ;
		//КонецЕсли;
	КонецЕсли; 
		
	// якщо немає замовлення постачальнику то склад наш
	//Партія загальна 
	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	  |	ПартииТоваровНаСкладахНалоговыйУчетОстатки.ДокументОприходования Как Партия,
	  |	ПартииТоваровНаСкладахНалоговыйУчетОстатки.КоличествоОстаток Как Количество,
	  |	ПартииТоваровНаСкладахНалоговыйУчетОстатки.СтоимостьОстаток Как Стоимость
	  |ИЗ
	  |	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	  |			&Момент,
	  |			Номенклатура = &Номенклатура
	  |				И Склад = &Склад) КАК ПартииТоваровНаСкладахНалоговыйУчетОстатки";
	  Запрос.УстановитьПараметр("Момент",КонецДня(Дата));
	  Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	  Запрос.УстановитьПараметр("Организация",Организация);
	  Запрос.УстановитьПараметр("Склад",Склад);
	  Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции


Процедура БП_ПерепроведениеРеализацииПоХронологии() Экспорт
	//+БП: bsoft (10.11.2025) <> 
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БП_ДокументыДляПерепроведения.Документ
	                      |ИЗ
	                      |	РегистрСведений.БП_ДокументыДляПерепроведения КАК БП_ДокументыДляПерепроведения
	                      |ГДЕ
	                      |	НЕ БП_ДокументыДляПерепроведения.Проведено");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
		
		РеализацияТоваровУслуг = Выборка.Документ; 
		ЗаказПокупателя = Выборка.Документ.Сделка;
		
		МассивЗаказовПоставщику = Новый Массив;
		ТЗ_Док_НеНашСклад = Новый ТаблицаЗначений;
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ЗаказПоставщику.Ссылка
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|ГДЕ
		|	ЗаказПоставщику.Проведен 
		|	И ЗаказПоставщику.ДокументОснование = &ДокументОснование 
		|	И ЗаказПоставщику.БП_ВидЗаказаПоставщику = &БП_ВидЗаказаПоставщику
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПоставщику.Ссылка");
			
		Запрос.УстановитьПараметр("ДокументОснование", ЗаказПокупателя); 
		Запрос.УстановитьПараметр("БП_ВидЗаказаПоставщику", Перечисления.БП_ВидЗаказаПоставщику.Менеджер);
		
		Выборка1 = Запрос.Выполнить().Выбрать();
		
		Пока Выборка1.Следующий() цикл
			МассивЗаказовПоставщику.Добавить(Выборка1.Ссылка);	
		КонецЦикла;                          
		
		Если МассивЗаказовПоставщику.Количество() тогда
			// якщо є замовлення постачальнику то склад НЕ наш
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ПоступлениеТоваровУслуг.Ссылка КАК ПоступлениеТоваровУслуг,
			|	ПоступлениеТоваровУслуг.Сделка КАК ЗаказПоставщику
			|ИЗ
			|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
			|ГДЕ
			|	ПоступлениеТоваровУслуг.Сделка В(&Сделка)
			|	И ПоступлениеТоваровУслуг.Проведен");
			
			Запрос.УстановитьПараметр("Сделка", МассивЗаказовПоставщику); 
			
			ТЗ_Док_НеНашСклад = Запрос.Выполнить().Выгрузить();
		КонецЕсли; 
		
		
		МассивПеремещенийТоваров = Новый Массив;
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ПеремещениеТоваров.Ссылка
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.ВнутреннийЗаказ = &ЗаказПокупателя
		|	И ПеремещениеТоваров.Проведен");
		
		Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя); 
		
		Выборка1 = Запрос.Выполнить().Выбрать();
		
		Пока Выборка1.Следующий() цикл
			//ПеремещениеТоваров = Выборка.Ссылка;
			МассивПеремещенийТоваров.Добавить(Выборка1.Ссылка);
		КонецЦикла; 
		
		
		//--------------------------- Алгоритм проверки  
		
		Попытка
			
			ХронологияНарушена = Ложь; 
			МаксДатаЗаказовПоставщику = Дата("00010101");	
			Для каждого Стр из МассивЗаказовПоставщику цикл
				Если Стр.Дата > МаксДатаЗаказовПоставщику тогда
					МаксДатаЗаказовПоставщику = Стр.Дата;          
				КонецЕсли;
			КонецЦикла;
			
			
			МаксДатаПоступления = Дата("00010101");	
			Для каждого Стр из ТЗ_Док_НеНашСклад цикл                            
				Если МаксДатаЗаказовПоставщику >= Стр.ПоступлениеТоваровУслуг.Дата тогда
					ХронологияНарушена = Истина;
				КонецЕсли;

				Если Стр.ПоступлениеТоваровУслуг.Дата > МаксДатаПоступления тогда
					МаксДатаПоступления = Стр.ПоступлениеТоваровУслуг.Дата;          
				КонецЕсли;
			КонецЦикла;
			
			МаксДатаПеремещениеТоваров = Дата("00010101");
			Для каждого ДокПеремещениеТоваров из МассивПеремещенийТоваров цикл 
				Если МаксДатаПоступления >= ДокПеремещениеТоваров.Дата тогда
					ХронологияНарушена = Истина;
				КонецЕсли;
				
				Если ДокПеремещениеТоваров.Дата >= МаксДатаПеремещениеТоваров тогда
					МаксДатаПеремещениеТоваров = ДокПеремещениеТоваров.Дата;          
				КонецЕсли;
				
			КонецЦикла;
			
			Если МаксДатаПеремещениеТоваров >= РеализацияТоваровУслуг.Дата тогда
				ХронологияНарушена = Истина;
			КонецЕсли;
			
			
			
			///	
			
			Если ХронологияНарушена тогда
				Для каждого Стр из МассивЗаказовПоставщику цикл
					ЗаказовПоставщику = Стр.ПолучитьОбъект();
					ЗаказовПоставщику.Комментарий = ЗаказовПоставщику.Комментарий + " #Перепроведено автоматично " + Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
					ЗаказовПоставщику.Дата = РеализацияТоваровУслуг.Дата - 6;          
					ЗаказовПоставщику.Записать(РежимЗаписиДокумента.Проведение);
				КонецЦикла;
			КонецЕсли;

			Для каждого Стр из ТЗ_Док_НеНашСклад цикл
				ДокПоступление = Стр.ПоступлениеТоваровУслуг.ПолучитьОбъект();
				ДокПоступление.Комментарий = ДокПоступление.Комментарий + " #Перепроведено автоматично " + Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
				Если ХронологияНарушена тогда
					ДокПоступление.Дата = РеализацияТоваровУслуг.Дата - 4;          
				КонецЕсли;
				ДокПоступление.Записать(РежимЗаписиДокумента.Проведение); 
				
			КонецЦикла;
			
			МаксДатаПеремещениеТоваров = Дата("00010101");
			Для каждого ДокПеремещениеТоваров из МассивПеремещенийТоваров цикл 
				ДокПеремещениеТоваровОб = ДокПеремещениеТоваров.ПолучитьОбъект();
				Если ХронологияНарушена тогда
					ДокПеремещениеТоваровОб.Дата = РеализацияТоваровУслуг.Дата - 2;;
				КонецЕсли;
				
				ДокПеремещениеТоваровОб.Комментарий = ДокПеремещениеТоваровОб.Комментарий + " #Перепроведено автоматично " + Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
				ДокПеремещениеТоваровОб.Записать(РежимЗаписиДокумента.Проведение);
								
			КонецЦикла;
			
			
			//+БП: d.matyash (16.12.2025) <> 
			СтарыйСтатус = ЗаказПокупателя.Статус;
			//-БП: d.matyash (16.12.2025) <>
			
			РеализацияТоваровУслугОб = РеализацияТоваровУслуг.ПолучитьОбъект();
			РеализацияТоваровУслугОб.Комментарий = РеализацияТоваровУслугОб.Комментарий + " #Перепроведено автоматично " + Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
			РеализацияТоваровУслугОб.Записать(РежимЗаписиДокумента.Проведение);	
			
			//+БП: d.matyash (16.12.2025) <> 
			Если ЗаказПокупателя.Статус <>  СтарыйСтатус Тогда
				ДокЗакОб = ЗаказПокупателя.ПолучитьОбъект();
				ДокЗакОб.Статус = СтарыйСтатус;
				ДокЗакОб.Записать();
			КонецЕслИ;
			//+БП: d.matyash (16.12.2025) <>			
			
			
			МенеджерЗаписи = РегистрыСведений.БП_ДокументыДляПерепроведения.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Документ = РеализацияТоваровУслуг;
			МенеджерЗаписи.Проведено = Истина;
			МенеджерЗаписи.Статус = "Успішно";
			
			МенеджерЗаписи.Записать();
		Исключение  
			
			МенеджерЗаписи = РегистрыСведений.БП_ДокументыДляПерепроведения.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Документ = РеализацияТоваровУслуг;
			МенеджерЗаписи.Проведено = Ложь;
			МенеджерЗаписи.Статус = ОписаниеОшибки();
			
			МенеджерЗаписи.Записать();

			Продолжить;
		КонецПопытки;
	КонецЦикла;
	//-БП: bsoft (10.11.2025) <>
КонецПроцедуры

Процедура ИсправитьПартииДляРеализации(РеализаияТоваровИУслуг) Экспорт

			Если Не РеализаияТоваровИУслуг.Проведен ИЛИ Не РеализаияТоваровИУслуг.ОтражатьВУправленческомУчете тогда
			Сообщить("Документ реалізації не є проведеним або не відображений в упр. обліку!");
			Возврат;
		КонецЕсли;
		
		
		РеализацияТоваровУслуг = РеализаияТоваровИУслуг; 
		ЗаказПокупателя = РеализаияТоваровИУслуг.Сделка;
		
		МассивЗаказовПоставщику = Новый Массив;
		ТЗ_Док_НеНашСклад = Новый ТаблицаЗначений;
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ЗаказПоставщику.Ссылка
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|ГДЕ
		|	ЗаказПоставщику.Проведен 
		|	И ЗаказПоставщику.ДокументОснование = &ДокументОснование 
		|	И ЗаказПоставщику.БП_ВидЗаказаПоставщику = &БП_ВидЗаказаПоставщику
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПоставщику.Ссылка");
			
		Запрос.УстановитьПараметр("ДокументОснование", ЗаказПокупателя); 
		Запрос.УстановитьПараметр("БП_ВидЗаказаПоставщику", Перечисления.БП_ВидЗаказаПоставщику.Менеджер);
		
		Выборка1 = Запрос.Выполнить().Выбрать();
		
		Пока Выборка1.Следующий() цикл
			МассивЗаказовПоставщику.Добавить(Выборка1.Ссылка);	
		КонецЦикла;                          
		
		Если МассивЗаказовПоставщику.Количество() тогда
			// якщо є замовлення постачальнику то склад НЕ наш
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ПоступлениеТоваровУслуг.Ссылка КАК ПоступлениеТоваровУслуг,
			|	ПоступлениеТоваровУслуг.Сделка КАК ЗаказПоставщику
			|ИЗ
			|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
			|ГДЕ
			|	ПоступлениеТоваровУслуг.Сделка В(&Сделка)
			|	И ПоступлениеТоваровУслуг.Проведен");
			
			Запрос.УстановитьПараметр("Сделка", МассивЗаказовПоставщику); 
			
			ТЗ_Док_НеНашСклад = Запрос.Выполнить().Выгрузить();
		КонецЕсли; 
		
		
		МассивПеремещенийТоваров = Новый Массив;
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ПеремещениеТоваров.Ссылка
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.ВнутреннийЗаказ = &ЗаказПокупателя
		|	И ПеремещениеТоваров.Проведен");
		
		Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя); 
		
		Выборка1 = Запрос.Выполнить().Выбрать();
		
		Пока Выборка1.Следующий() цикл
			//ПеремещениеТоваров = Выборка.Ссылка;
			МассивПеремещенийТоваров.Добавить(Выборка1.Ссылка);
		КонецЦикла; 
		
		
		//--------------------------- Алгоритм проверки  
		
		Попытка
			
			ХронологияНарушена = Ложь; 
			МаксДатаЗаказовПоставщику = Дата("00010101");	
			Для каждого Стр из МассивЗаказовПоставщику цикл
				Если Стр.Дата > МаксДатаЗаказовПоставщику тогда
					МаксДатаЗаказовПоставщику = Стр.Дата;          
				КонецЕсли;
			КонецЦикла;
			
			
			МаксДатаПоступления = Дата("00010101");	
			Для каждого Стр из ТЗ_Док_НеНашСклад цикл                            
				Если МаксДатаЗаказовПоставщику >= Стр.ПоступлениеТоваровУслуг.Дата тогда
					ХронологияНарушена = Истина;
				КонецЕсли;

				Если Стр.ПоступлениеТоваровУслуг.Дата > МаксДатаПоступления тогда
					МаксДатаПоступления = Стр.ПоступлениеТоваровУслуг.Дата;          
				КонецЕсли;
			КонецЦикла;
			
			МаксДатаПеремещениеТоваров = Дата("00010101");
			Для каждого ДокПеремещениеТоваров из МассивПеремещенийТоваров цикл 
				Если МаксДатаПоступления >= ДокПеремещениеТоваров.Дата тогда
					ХронологияНарушена = Истина;
				КонецЕсли;
				
				Если ДокПеремещениеТоваров.Дата >= МаксДатаПеремещениеТоваров тогда
					МаксДатаПеремещениеТоваров = ДокПеремещениеТоваров.Дата;          
				КонецЕсли;
				
			КонецЦикла;
			
			Если МаксДатаПеремещениеТоваров >= РеализацияТоваровУслуг.Дата тогда
				ХронологияНарушена = Истина;
			КонецЕсли;
			
			
			
			///	
			Если ХронологияНарушена тогда
				Для каждого Стр из МассивЗаказовПоставщику цикл
					ЗаказовПоставщику = Стр.ПолучитьОбъект();
					ЗаказовПоставщику.Комментарий = ЗаказовПоставщику.Комментарий + " #Перепроведено автоматично " + Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
					ЗаказовПоставщику.Дата = РеализацияТоваровУслуг.Дата - 6;          
					ЗаказовПоставщику.Записать(РежимЗаписиДокумента.Проведение);
				КонецЦикла;
			КонецЕсли;
			
			Для каждого Стр из ТЗ_Док_НеНашСклад цикл
				ДокПоступление = Стр.ПоступлениеТоваровУслуг.ПолучитьОбъект();
				ДокПоступление.Комментарий = ДокПоступление.Комментарий + " #Перепроведено автоматично " + Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
				Если ХронологияНарушена тогда
					ДокПоступление.Дата = РеализацияТоваровУслуг.Дата - 4;          
				КонецЕсли;
				ДокПоступление.Записать(РежимЗаписиДокумента.Проведение); 
				
			КонецЦикла;
			
			МаксДатаПеремещениеТоваров = Дата("00010101");
			Для каждого ДокПеремещениеТоваров из МассивПеремещенийТоваров цикл 
				ДокПеремещениеТоваровОб = ДокПеремещениеТоваров.ПолучитьОбъект();
				Если ХронологияНарушена тогда
					ДокПеремещениеТоваровОб.Дата = РеализацияТоваровУслуг.Дата - 2;;
				КонецЕсли;
				
				ДокПеремещениеТоваровОб.Комментарий = ДокПеремещениеТоваровОб.Комментарий + " #Перепроведено автоматично " + Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
				ДокПеремещениеТоваровОб.Записать(РежимЗаписиДокумента.Проведение);
								
			КонецЦикла; 
			
			//+БП: d.matyash (16.12.2025) <> 
			СтарыйСтатус = ЗаказПокупателя.Статус;
			//-БП: d.matyash (16.12.2025) <>
			
			РеализацияТоваровУслугОб = РеализацияТоваровУслуг.ПолучитьОбъект();
			РеализацияТоваровУслугОб.Комментарий = РеализацияТоваровУслугОб.Комментарий + " #Перепроведено автоматично " + Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
			РеализацияТоваровУслугОб.Записать(РежимЗаписиДокумента.Проведение);		
			
			
			//+БП: d.matyash (16.12.2025) <> 
			Если ЗаказПокупателя.Статус <>  СтарыйСтатус Тогда
				ДокЗакОб = ЗаказПокупателя.ПолучитьОбъект();
				ДокЗакОб.Статус = СтарыйСтатус;
				ДокЗакОб.Записать();
			КонецЕслИ;
			//+БП: d.matyash (16.12.2025) <>
			
			МенеджерЗаписи = РегистрыСведений.БП_ДокументыДляПерепроведения.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Документ = РеализацияТоваровУслуг;
			МенеджерЗаписи.Проведено = Истина;
			МенеджерЗаписи.Статус = "Успішно";
			
			МенеджерЗаписи.Записать();
		Исключение  
			
			МенеджерЗаписи = РегистрыСведений.БП_ДокументыДляПерепроведения.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Документ = РеализацияТоваровУслуг;
			МенеджерЗаписи.Проведено = Ложь;
			МенеджерЗаписи.Статус = ОписаниеОшибки();
			
			МенеджерЗаписи.Записать();

		КонецПопытки;
	//-БП: bsoft (10.11.2025) <>

КонецПроцедуры

//+БП: @Cvet_kov (27.08.2026) <>
// Возвращает вид заказа поставщику, соответствующий группе текущего пользователя.
//
// Правило продиктовано проверкой в ПередЗаписью формы заказа поставщику: пользователю
// из группы "Менеджера" платформа молча отказывает в записи документа с любым другим видом.
// Для остальных групп вид не определён (в закомментированной проверке был "Бухгалтерія"),
// поэтому возвращается пустая ссылка и вид выбирается вручную.
//
Функция ВидЗаказаПоставщикуПоТекущемуПользователю() Экспорт

	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;

	Если НЕ ЗначениеЗаполнено(ТекущийПользователь) Тогда
		Возврат Перечисления.БП_ВидЗаказаПоставщику.ПустаяСсылка();
	КонецЕсли;

	Если СокрЛП(ТекущийПользователь.Родитель.Наименование) = "Менеджера" Тогда
		Возврат Перечисления.БП_ВидЗаказаПоставщику.Менеджер;
	КонецЕсли;

	Возврат Перечисления.БП_ВидЗаказаПоставщику.ПустаяСсылка();

КонецФункции

// Подставляет вид заказа поставщику по текущему пользователю, если вид ещё не выбран.
// Осознанный выбор пользователя не перебивается.
//
Процедура ЗаполнитьВидЗаказаПоставщикуПоТекущемуПользователю(ЗаказПоставщикуОбъект) Экспорт

	Если ЗначениеЗаполнено(ЗаказПоставщикуОбъект.БП_ВидЗаказаПоставщику) Тогда
		Возврат;
	КонецЕсли;

	ЗаказПоставщикуОбъект.БП_ВидЗаказаПоставщику = ВидЗаказаПоставщикуПоТекущемуПользователю();

КонецПроцедуры
//-БП: @Cvet_kov (27.08.2026) <>

//+БП: @Cvet_kov (28.08.2026) <>
// Возвращает приоритет "Б/Н" из справочника БП_Приоритеты.
//
// Предопределённых элементов у справочника нет — приоритеты заводятся руками,
// поэтому опознаём по коду (000000001): наименование правят, код нет.
// Элемента с таким кодом нет — возвращается пустая ссылка, приоритет
// выбирается вручную как раньше.
//
Функция ПриоритетБезналичный() Экспорт

	Возврат Справочники.БП_Приоритеты.НайтиПоКоду("000000001");

КонецФункции

// Подставляет приоритет "Б/Н" в заказ поставщику, если приоритет ещё не выбран.
// Осознанный выбор пользователя не перебивается.
//
Процедура ЗаполнитьПриоритетБезналичный(ЗаказПоставщикуОбъект) Экспорт

	Если ЗначениеЗаполнено(ЗаказПоставщикуОбъект.БП_Приоритет) Тогда
		Возврат;
	КонецЕсли;

	ЗаказПоставщикуОбъект.БП_Приоритет = ПриоритетБезналичный();

КонецПроцедуры
//-БП: @Cvet_kov (28.08.2026) <>

//+БП: @Cvet_kov (30.08.2026) <>
// Заказ поставщику, созданный из заказа покупателя кнопкой "Сформировать заказ поставщику",
// приезжал без договора: колонка ДоговорКонтрагента в строке заказа покупателя чаще всего
// пустая, а валюта документа берётся как раз из неё. Договор приходилось подтягивать вручную,
// перевыбирая контрагента в уже открытом заказе, и типовой ПриИзмененииЗначенияДоговора
// спрашивал про пересчёт по договору и открывал форму "Цены и валюта".
//
// Здесь то же самое делается под капотом: договор подбирается, а если подходящего нет -
// создаётся (так же, как ПоискСозданиеДоговора делает для покупателей), после чего валюта,
// курс и кратность взаиморасчётов синхронизируются с договором.
//
// Вызывать ПОСЛЕ того, как окончательно определена организация: её подменяет автозамена
// по справочнику БП_НастройкиАвтозаменыОрганизацииВЗаказеПоставщику, а договор привязан
// к организации.
//
// Цены табличных частей не пересчитываются: они скопированы из заказа покупателя
// (колонка ЦенаПокупки) и остаются как есть - как и до правки.
//
Процедура ЗаполнитьДоговорПоставщикаИВалюту(ЗаказПоставщикуОбъект) Экспорт

	Если НЕ ЗначениеЗаполнено(ЗаказПоставщикуОбъект.Контрагент)
		ИЛИ НЕ ЗначениеЗаполнено(ЗаказПоставщикуОбъект.Организация) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыДоговора = ПараметрыДоговораЗаказаПоставщику();

	// договор, приехавший из строки заказа покупателя, может быть чужим: не той организации
	// (её подменяет автозамена), не того контрагента или не того вида
	Если НЕ ЗаполнениеДокументов.МожноИспользоватьДоговорДляДокумента(
				ЗаказПоставщикуОбъект.ДоговорКонтрагента,
				ЗаказПоставщикуОбъект.Контрагент,
				ЗаказПоставщикуОбъект.Организация,
				ПараметрыДоговора) Тогда

		Договор = НайтиДоговорПоставщика(ЗаказПоставщикуОбъект.Организация, ЗаказПоставщикуОбъект.Контрагент);

		Если НЕ ЗначениеЗаполнено(Договор) Тогда
			Договор = СоздатьДоговорПоставщика(ЗаказПоставщикуОбъект.Организация, ЗаказПоставщикуОбъект.Контрагент);
		КонецЕсли;

		ЗаказПоставщикуОбъект.ДоговорКонтрагента = Договор;

	КонецЕсли;

	СинхронизироватьВзаиморасчетыСДоговором(ЗаказПоставщикуОбъект);

КонецПроцедуры

// Параметры отбора договора для заказа поставщику - те же, что документ держит
// в мСтруктураПараметровДляПолученияДоговора: договоры покупки, взаиморасчёты
// по договору в целом или по заказам.
//
Функция ПараметрыДоговораЗаказаПоставщику()

	Параметры = ЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПокупки();

	СписокВзаиморасчетов = Новый СписокЗначений();
	СписокВзаиморасчетов.Добавить(Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом);
	СписокВзаиморасчетов.Добавить(Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам);
	Параметры.Вставить("СписокДопустимыхВидовВзаиморасчетов", СписокВзаиморасчетов);

	Возврат Параметры;

КонецФункции

// Ищет договор поставщика по паре "организация + контрагент".
// Порядок отбора задан явно, чтобы выбор не зависел от порядка записей в базе:
// сначала основной договор контрагента, затем договоры с поставщиком (а не с комитентом),
// дальше по наименованию.
//
Функция НайтиДоговорПоставщика(Организация, Контрагент)

	УстановитьПривилегированныйРежим(Истина);

	ВидыДоговоров = Новый Массив();
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);

	ВидыВзаиморасчетов = Новый Массив();
	ВидыВзаиморасчетов.Добавить(Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом);
	ВидыВзаиморасчетов.Добавить(Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам);

	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ДоговорыКонтрагентов.Ссылка КАК Договор
	                      |ИЗ
	                      |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                      |ГДЕ
	                      |	ДоговорыКонтрагентов.Владелец = &Контрагент
	                      |	И ДоговорыКонтрагентов.Организация = &Организация
	                      |	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	                      |	И НЕ ДоговорыКонтрагентов.ЭтоГруппа
	                      |	И ДоговорыКонтрагентов.ВидДоговора В (&ВидыДоговоров)
	                      |	И ДоговорыКонтрагентов.ВедениеВзаиморасчетов В (&ВидыВзаиморасчетов)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ВЫБОР
	                      |		КОГДА ДоговорыКонтрагентов.Ссылка = &ОсновнойДоговор
	                      |			ТОГДА 0
	                      |		ИНАЧЕ 1
	                      |	КОНЕЦ,
	                      |	ВЫБОР
	                      |		КОГДА ДоговорыКонтрагентов.ВидДоговора = &ВидСПоставщиком
	                      |			ТОГДА 0
	                      |		ИНАЧЕ 1
	                      |	КОНЕЦ,
	                      |	ДоговорыКонтрагентов.Наименование");

	Запрос.УстановитьПараметр("Контрагент",         Контрагент);
	Запрос.УстановитьПараметр("Организация",        Организация);
	Запрос.УстановитьПараметр("ВидыДоговоров",      ВидыДоговоров);
	Запрос.УстановитьПараметр("ВидыВзаиморасчетов", ВидыВзаиморасчетов);
	Запрос.УстановитьПараметр("ОсновнойДоговор",    Контрагент.ОсновнойДоговорКонтрагента);
	Запрос.УстановитьПараметр("ВидСПоставщиком",    Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);

	Выборка = Запрос.Выполнить().Выбрать();

	УстановитьПривилегированныйРежим(Ложь);

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Договор;
	КонецЕсли;

	Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();

КонецФункции

// Создаёт договор с поставщиком - по образцу ПоискСозданиеДоговора, который делает
// то же самое для договоров с покупателем.
//
Функция СоздатьДоговорПоставщика(Организация, Контрагент)

	УстановитьПривилегированныйРежим(Истина);

	НовыйДоговор                       = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	НовыйДоговор.Наименование          = НСтр("ru='Основной договор с поставщиком';uk='Основний договір з постачальником'");
	НовыйДоговор.Владелец              = Контрагент;
	НовыйДоговор.Организация           = Организация;
	НовыйДоговор.ВидДоговора           = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
	НовыйДоговор.ВидУсловийДоговора    = Перечисления.ВидыУсловийДоговоровВзаиморасчетов.БезДополнительныхУсловий;
	НовыйДоговор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам;
	НовыйДоговор.БП_ТипДоговора        = Справочники.БП_ТипыДоговоровКонтрагентов.Стандартный;
	НовыйДоговор.ТипЦен                = Справочники.ТипыЦенНоменклатурыКонтрагентов.ПустаяСсылка();

	НовыйДоговор.ВалютаВзаиморасчетов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяВалютаВзаиморасчетов");
	Если НЕ ЗначениеЗаполнено(НовыйДоговор.ВалютаВзаиморасчетов) Тогда
		НовыйДоговор.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	КонецЕсли;

	Если Контрагент.НеЯвляетсяРезидентом Тогда
		НовыйДоговор.Внешнеэкономический = Истина;
		Если НовыйДоговор.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаРегламентированногоУчета") Тогда
			НовыйДоговор.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаУправленческогоУчета");
		КонецЕсли;
	КонецЕсли;

	НовыйДоговор.УстановитьСхемуНалогообложения();
	НовыйДоговор.СхемаНалоговогоУчетаПоТаре = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.ПоПервомуСобытию;
	НовыйДоговор.ВыводитьИнформациюОСделкеПриПечатиДокументов = Истина;
	НовыйДоговор.Комментарий = "#Створено автоматично!";

	Попытка
		НовыйДоговор.Записать();
		Сообщить("Успішно створено новий договір з постачальником!");
		Результат = НовыйДоговор.Ссылка;
	Исключение
		Сообщить("Не вдалося створити договір з постачальником! " + ОписаниеОшибки());
		Результат = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецПопытки;

	УстановитьПривилегированныйРежим(Ложь);

	Возврат Результат;

КонецФункции

// Валюта, курс и кратность взаиморасчётов - из договора. Без этого форма заказа
// поставщику при первом же изменении контрагента или договора спрашивает
// "Пересчитать документ в соответствии с договором?" и открывает "Цены и валюта".
//
Процедура СинхронизироватьВзаиморасчетыСДоговором(ЗаказПоставщикуОбъект)

	Договор = ЗаказПоставщикуОбъект.ДоговорКонтрагента;

	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Договор.ВалютаВзаиморасчетов) Тогда
		ЗаказПоставщикуОбъект.ВалютаДокумента = Договор.ВалютаВзаиморасчетов;
		СтруктураКурса = МодульВалютногоУчета.ПолучитьКурсВалюты(Договор.ВалютаВзаиморасчетов, ЗаказПоставщикуОбъект.Дата);
		ЗаказПоставщикуОбъект.КурсВзаиморасчетов      = СтруктураКурса.Курс;
		ЗаказПоставщикуОбъект.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
	КонецЕсли;

	// Тип цен - тоже часть параметров договора; сами цены при этом не пересчитываются.
	// Тип проверяем: у договора ТипЦен может быть и ТипыЦенНоменклатуры (у договоров
	// с покупателем), а реквизит заказа поставщику принимает только цены контрагентов.
	Если НЕ ЗначениеЗаполнено(ЗаказПоставщикуОбъект.ТипЦен)
		И ЗначениеЗаполнено(Договор.ТипЦен)
		И ТипЗнч(Договор.ТипЦен) = Тип("СправочникСсылка.ТипыЦенНоменклатурыКонтрагентов") Тогда
		ЗаказПоставщикуОбъект.ТипЦен = Договор.ТипЦен;
	КонецЕсли;

КонецПроцедуры
//-БП: @Cvet_kov (30.08.2026) <>
